### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.backend.azuread_application.terraform_app will be created
+   resource "azuread_application" "terraform_app" {
+       app_role_ids                = (known after apply)
+       application_id              = (known after apply)
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "terraform-SPN"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       prevent_duplicate_names     = false
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       feature_tags {
+           custom_single_sign_on = (known after apply)
+           enterprise            = (known after apply)
+           gallery               = (known after apply)
+           hide                  = (known after apply)
        }
    }

  # module.backend.azuread_service_principal.terraform_app_sp will be created
+   resource "azuread_service_principal" "terraform_app_sp" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_id              = (known after apply)
+       application_tenant_id       = (known after apply)
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)

+       feature_tags {
+           custom_single_sign_on = (known after apply)
+           enterprise            = (known after apply)
+           gallery               = (known after apply)
+           hide                  = (known after apply)
        }

+       features {
+           custom_single_sign_on_app = (known after apply)
+           enterprise_application    = (known after apply)
+           gallery_application       = (known after apply)
+           visible_to_users          = (known after apply)
        }
    }

  # module.backend.azuread_service_principal_password.terraform_app_sp_pwd will be created
+   resource "azuread_service_principal_password" "terraform_app_sp_pwd" {
+       display_name         = (known after apply)
+       end_date             = (known after apply)
+       id                   = (known after apply)
+       key_id               = (known after apply)
+       service_principal_id = (known after apply)
+       start_date           = (known after apply)
+       value                = (sensitive value)
    }

  # module.backend.azurerm_key_vault.backend_kv will be created
+   resource "azurerm_key_vault" "backend_kv" {
+       access_policy                   = [
+           {
+               application_id          = null
+               certificate_permissions = []
+               key_permissions         = []
+               object_id               = (known after apply)
+               secret_permissions      = [
+                   "get",
+                   "list",
                ]
+               storage_permissions     = []
+               tenant_id               = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
            },
+           {
+               application_id          = null
+               certificate_permissions = []
+               key_permissions         = []
+               object_id               = "4300fc00-0311-4b58-9eca-6e871df84c82"
+               secret_permissions      = [
+                   "backup",
+                   "delete",
+                   "purge",
+                   "recover",
+                   "restore",
+                   "set",
+                   "get",
+                   "list",
                ]
+               storage_permissions     = []
+               tenant_id               = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
            },
        ]
+       enabled_for_deployment          = false
+       enabled_for_disk_encryption     = false
+       enabled_for_template_deployment = false
+       id                              = (known after apply)
+       location                        = "uksouth"
+       name                            = "pwd9000kv4980"
+       purge_protection_enabled        = false
+       resource_group_name             = "BackendRG"
+       sku_name                        = "standard"
+       soft_delete_enabled             = (known after apply)
+       soft_delete_retention_days      = 7
+       tags                            = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Backend-Key-Vault-Development"
        }
+       tenant_id                       = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                       = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.backend.azurerm_key_vault_secret.terraform_client_id will be created
+   resource "azurerm_key_vault_secret" "terraform_client_id" {
+       content_type   = "ARM_CLIENT_ID"
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = "tf-arm-client-id"
+       tags           = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Service-Principal-Application-ID"
        }
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.backend.azurerm_key_vault_secret.terraform_client_secret will be created
+   resource "azurerm_key_vault_secret" "terraform_client_secret" {
+       content_type   = "ARM_CLIENT_SECRET"
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = "tf-arm-client-secret"
+       tags           = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Service-Principal-Application-Secret"
        }
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.backend.azurerm_role_assignment.primary_rg_ra will be created
+   resource "azurerm_role_assignment" "primary_rg_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/providers/Microsoft.Authorization/roleDefinitions/74d7c518-c37e-eb87-c4aa-534aee03db0b"
+       role_definition_name             = (known after apply)
+       scope                            = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/PrimaryRG"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_role_assignment.primary_sa_container_ra will be created
+   resource "azurerm_role_assignment" "primary_sa_container_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Storage Blob Data Contributor"
+       scope                            = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa4980/blobServices/default/containers/primary-remote-state"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_storage_account.backend_sa will be updated in-place
!   resource "azurerm_storage_account" "backend_sa" {
        id                                = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa4980"
        name                              = "pwd9000sa4980"
!       tags                              = {
-           "NewTag2"    = "last2" -> null
-           "Tag1"       = "first1" -> null
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.backend.null_resource.setup-log will be created
+   resource "null_resource" "setup-log" {
+       id = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```
</details>